HashDefineElectronics/Reflow-O-Matic/Packages/.cache/Keil.STM32F4xx_DFP.2.7.0.pdsc
      <!-- ************************  Subfamily 'STM32F401'  **************************** -->
      <subFamily DsubFamily="STM32F401">
        <processor Dclock="84000000"/>
        <debug      svd="CMSIS/SVD/STM32F401x.svd"/>
        <debugvars configfile="CMSIS/Debug/STM32F401xBCDE_411xCE.dbgconf">
          // Debug Access Variables, can be modified by user via copy of STM32F401xBCDE_411xCE.dbgconf created by uVision.
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>
        <book       name="Documentation/DM00096844.pdf"              title="STM32F401xB/C/D/E Reference Manual"/>
        <book       name="Documentation/DM00095523.pdf"              title="STM32F401xB/C/D/E Errata Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="I2C"           n="3"/>
        <feature type="USART"         n="3"       m="10500000"/>
        <feature type="USBOTG"        n="1"/>
        <feature type="VCC"           n="1.70"    m="3.60"/>

        <!-- *************************  Device 'STM32F401CB'  ***************************** -->
        <device Dname="STM32F401CB">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xC"/>
          <book       name="Documentation/DM00086815.pdf"              title="STM32F401xB/401xC Data Sheet"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_128.FLM"   start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="36"/>
          <feature type="SPI"           n="3"       m="42000000"/>
          <variant Dvariant="STM32F401CBUx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32F401CBYx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401RB'  ***************************** -->
        <device Dname="STM32F401RB">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xC"/>
          <book       name="Documentation/DM00086815.pdf"              title="STM32F401xB/401xC Data Sheet"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_128.FLM"   start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="48"/>
          <feature type="SPI"           n="3"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F401RBTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401VB'  ***************************** -->
        <device Dname="STM32F401VB">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xC"/>
          <book       name="Documentation/DM00086815.pdf"              title="STM32F401xB/401xC Data Sheet"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_128.FLM"   start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F401VBTx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32F401VBHx"> <feature type="BGA" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401CC'  ***************************** -->
        <device Dname="STM32F401CC">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xC"/>
          <book       name="Documentation/DM00086815.pdf"              title="STM32F401xB/401xC Data Sheet"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="36"/>
          <feature type="SPI"           n="3"       m="42000000"/>
          <variant Dvariant="STM32F401CCUx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32F401CCYx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401RC'  ***************************** -->
        <device Dname="STM32F401RC">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xC"/>
          <book       name="Documentation/DM00086815.pdf"              title="STM32F401xB/401xC Data Sheet"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="48"/>
          <feature type="SPI"           n="3"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F401RCTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401VC'  ***************************** -->
        <device Dname="STM32F401VC">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xC"/>
          <book       name="Documentation/DM00086815.pdf"              title="STM32F401xB/401xC Data Sheet"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F401VCTx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32F401VCHx"> <feature type="BGA" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401CD'  ***************************** -->
        <device Dname="STM32F401CD">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xE"/>
          <book       name="Documentation/DM00102166.pdf"              title="STM32F401xD/401xE Data Sheet"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_384.FLM"   start="0x08000000"  size="0x60000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F401CDUx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32F401CDYx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401RD'  ***************************** -->
        <device Dname="STM32F401RD">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xE"/>
          <book       name="Documentation/DM00102166.pdf"              title="STM32F401xD/401xE Data Sheet"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_384.FLM"   start="0x08000000"  size="0x60000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F401RDTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401VD'  ***************************** -->
        <device Dname="STM32F401VD">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xE"/>
          <book       name="Documentation/DM00102166.pdf"              title="STM32F401xD/401xE Data Sheet"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_384.FLM"   start="0x08000000"  size="0x60000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F401VDTx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32F401VDHx"> <feature type="BGA" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401CE'  ***************************** -->
        <device Dname="STM32F401CE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xE"/>
          <debug      svd="CMSIS/SVD/STM32F401xE.svd"/>
          <book       name="Documentation/DM00102166.pdf"              title="STM32F401xD/401xE Data Sheet"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_512.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F401CEUx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32F401CEYx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401RE'  ***************************** -->
        <device Dname="STM32F401RE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xE"/>
          <debug      svd="CMSIS/SVD/STM32F401xE.svd"/>
          <book       name="Documentation/DM00102166.pdf"              title="STM32F401xD/401xE Data Sheet"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_512.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F401RETx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401VE'  ***************************** -->
        <device Dname="STM32F401VE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xE"/>
          <debug      svd="CMSIS/SVD/STM32F401xE.svd"/>
          <book       name="Documentation/DM00102166.pdf"              title="STM32F401xD/401xE Data Sheet"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_512.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F401VETx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32F401VEHx"> <feature type="BGA" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F410'  **************************** -->
      <subFamily DsubFamily="STM32F410">
        <processor Dclock="100000000"/>
        <debug     svd="CMSIS/SVD/STM32F410xx.svd"/>
        <debugvars configfile="CMSIS/Debug/STM32F401xBCDE_411xCE.dbgconf">
          // Debug Access Variables, can be modified by user via copy of STM32F401xBCDE_411xCE.dbgconf created by uVision.
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ
        </debugvars>

        <!-- *************************  Device 'STM32F410CB'  ***************************** -->
        <device Dname="STM32F410CB">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F410Cx"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_128.FLM"   start="0x08000000"  size="0x20000"                  default="1"/> 
          <variant Dvariant="STM32F410CBUx"> <feature type="QFN" n="48"/> </variant>
        </device>

