HashDefineElectronics/Reflow-O-Matic/Packages/.cache/Keil.STM32F4xx_DFP.2.7.0.pdsc
        <!-- *************************  Device 'STM32F427ZG'  ***************************** -->
        <device Dname="STM32F427ZG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <variant Dvariant="STM32F427ZGTx"> <feature type="QFP" n="144"/> </variant>
          <variant Dvariant="STM32F427ZGYx"> <feature type="CSP" n="143"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F427IG'  ***************************** -->
        <device Dname="STM32F427IG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>
          <variant Dvariant="STM32F427IGTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F427IGHx"> <feature type="BGA" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F427VI'  ***************************** -->
        <device Dname="STM32F427VI">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <variant Dvariant="STM32F427VITx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F427ZI'  ***************************** -->
        <device Dname="STM32F427ZI">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <variant Dvariant="STM32F427ZITx"> <feature type="QFP" n="144"/> </variant>
          <variant Dvariant="STM32F427ZIYx"> <feature type="CSP" n="143"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F427II'  ***************************** -->
        <device Dname="STM32F427II">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>
          <variant Dvariant="STM32F427IITx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F427IIHx"> <feature type="BGA" n="176"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F429'  **************************** -->
      <subFamily DsubFamily="STM32F429">
        <processor Dclock="180000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F429xx"/>
        <debug      svd="CMSIS/SVD/STM32F429x.svd"/>
        <debugvars configfile="CMSIS/Debug/STM32F40x_41x_42x_43x.dbgconf">
          // Debug Access Variables, can be modified by user via copy of STM32F401xBCDE_411xCE.dbgconf created by uVision.
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>
        <book       name="Documentation/DM00031020.pdf"              title="STM32F40x/41x/42x/43x Reference Manual"/>
        <book       name="Documentation/DM00071990.pdf"              title="STM32F427/429 Data Sheet"/>
        <book       name="Documentation/DM00068628.pdf"              title="STM32F42x/43x Errata Sheet"/>
        <feature type="Timer"         n="12"      m="16"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="6"       m="42000000"/>
        <feature type="ComOther"      n="1"                           name="SAI Interface"/>
        <feature type="I2C"           n="3"/>
        <feature type="USART"         n="4"       m="11250000"/>
        <feature type="UART"          n="4"       m="11250000"/>
        <feature type="USBOTG"        n="2"/>
        <feature type="CAN"           n="2"/>
        <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="VCC"           n="1.80"    m="3.60"/>
        <feature type="Camera"        n="1"       m="14"/>

        <!-- *************************  Device 'STM32F429VG'  ***************************** -->
        <device Dname="STM32F429VG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <variant Dvariant="STM32F429VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

