HashDefineElectronics/Reflow-O-Matic/Packages/.cache/Keil.STM32F4xx_DFP.2.7.0.pdsc
         <!-- *************************  Device 'STM32F479AG'  ***************************** -->
         <device Dname="STM32F479AG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F479AGHx"> <feature type="BGA" n="168"/> </variant>
          <variant Dvariant="STM32F479AGYx"> <feature type="CSP" n="168"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F479AI'  ***************************** -->
        <device Dname="STM32F479AI">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F479AIHx"> <feature type="BGA" n="168"/> </variant>
          <variant Dvariant="STM32F479AIYx"> <feature type="CSP" n="168"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F479IG'  ***************************** -->
        <device Dname="STM32F479IG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F479IGTx"> <feature type="QFP" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F479II'  ***************************** -->
        <device Dname="STM32F479II">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F479IITx"> <feature type="QFP" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F479BG'  ***************************** -->
        <device Dname="STM32F479BG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F479BGTx"> <feature type="QFP" n="208"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F479BI'  ***************************** -->
        <device Dname="STM32F479BI">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F479BITx"> <feature type="QFP" n="208"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F479NG'  ***************************** -->
        <device Dname="STM32F479NG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F479NGHx"> <feature type="BGA" n="216"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F479NI'  ***************************** -->
        <device Dname="STM32F479NI">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F479NIHx"> <feature type="BGA" n="216"/> </variant>
        </device>
      </subFamily>
    </family>
  </devices>

