HashDefineElectronics/Reflow-O-Matic/Packages/.cache/Keil.STM32F4xx_DFP.2.7.0.pdsc
      <component Cgroup="Joystick" Capiversion="1.00" condition="STM32F4 CMSIS RTOS I2C_Driver">
        <description>Joystick Interface for STMPE811</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/Joystick_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.00" condition="STM32F4 CMSIS RTOS I2C_Driver">
        <description>Touchscreen Interface for STMPE811</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/Touch_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="Accelerometer" Capiversion="1.00" condition="STM32F4 CMSIS I2C_Driver">
        <description>Accelerometer Interface for LIS3DH</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/Accelerometer_LIS3DH.c"/>
        </files>
      </component>
      <component Cgroup="Gyroscope" Capiversion="1.00" condition="STM32F4 CMSIS I2C_Driver">
        <description>Gyroscope Interface for L3G4200D</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/Gyroscope_L3G4200D.c"/>
        </files>
      </component>
      <component Cgroup="Camera" Capiversion="1.00" condition="STM32F4 HAL GPIO DMA DCMI I2C_Driver">
        <description>Camera Interface for OVM7690</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/Camera_OVM7690.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.00" condition="STM32F4 HAL GPIO SRAM">
        <description>Graphic LCD Interface for Keil MCBSTM32F400 Development Board</description>
        <files>
          <file category="header" name="MDK/Boards/Keil/MCBSTM32F400/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/GLCD_MCBSTM32F400.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1" Cvariant="16-bit IF" condition="STM32F4 HAL GPIO SRAM LCD_16">
        <description>emWin LCD 16-bit Interface for Keil MCBSTM32F400 Development Board</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/LCD_X.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32F4-Discovery Board -->
    <bundle Cbundle="STM32F4-Discovery" Cclass="Board Support" Cversion="2.0.0">
      <description>STMicroelectronics STM32F4 Discovery Kit</description>
      <doc>http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00037955.pdf</doc>
      <component Cgroup="LED" Capiversion="1.00" condition="STM32F4 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32F4-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F4-Discovery/Common/LED_F4Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="STM32F4 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32F4-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F4-Discovery/Common/Buttons_F4Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32F401C-Discovery Board -->
    <bundle Cbundle="STM32F401C-Discovery" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32F401C-Discovery Kit</description>
      <doc>http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00094495.pdf</doc>
      <component Cgroup="LED" Capiversion="1.00" condition="STM32F4 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32F401C-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F401C-Discovery/Common/LED_F401Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="STM32F4 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32F401C-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F401C-Discovery/Common/Buttons_F401Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32F429I-Discovery Board -->
    <bundle Cbundle="STM32F429I-Discovery" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32F429I-Discovery Kit</description>
      <doc>http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00094498.pdf</doc>
      <component Cgroup="LED" Capiversion="1.00" condition="STM32F4 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32F429I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/LED_F429Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="STM32F4 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32F429I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/Buttons_F429Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.00" condition="STM32F4 CMSIS RTOS I2C_Driver">
        <description>Touchscreen Interface for STMPE811</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/Touch_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1" Cvariant="RGB IF" condition="STM32F4 HAL GPIO SPI_Driver LCD_RGB">
        <description>emWin LCD RGB Interface for STMicroelectronics STM32F429I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/LCD_X.c"/>
        </files>
      </component>
    </bundle>

    <component Cclass="Graphics Display" Cgroup="STM32F429I-Discovery" Cvariant="RGB IF" Cversion="1.0.0" condition="STM32F4 HAL LTDC DMA2D Graphics LCD_RGB">
      <description>LCD Configuration for STM32F429I-Discovery LCD</description>
      <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/LCDConf.c" attr="config"/>
      </files>
    </component>
  </components>
</package>
